package ch06;

public class Ch06_2_4 {

	public static void main(String[] args) {

		// 클래스
		// 객체를 정의해 놓은 것
		// 용도-> 객체를 사용하는데 사용
		
		// 객체
		// 실제로 존재하는 것. 사물 또는 개념
		// 용도-> 객체가 가지고 있는 기능과 속성에 따라 다름
		
		// 클래스		객체
		// 제품설계도	제품
		// TV설계도	TV
		// 붕어빵기계	붕어빵
		
		// 객체(=인스턴스)
		// 객체
		// 모든 인스턴스를 대표하는 일반적 용어
		// 인스턴스
		// 특정 클래스로부터 생성된 객체(예:TV인스턴스)
		
		//			인스턴스화
		// 클래스		   ->		인스턴스(객체)
		
		/*
		 * Q. 클래스가 왜 필요한가?
		 * A. 객체를 사용하기 위해
		 * 
		 * Q. 객체가 왜 필요한가?
		 * A. 객체를 사용하기 위해
		 * 
		 * Q. 객체를 사용한다는것은?
		 * A. 객체가 가진 속성과 기능을 사용하려고 
		 */
		
		
	}

}
