package ch06;

public class Ch06_14_16 {

	public static void main(String[] args) {

		// 메서드란? 
		// 함수와의 차이는?
		// -> 메서드는 함수와 다르게 클래스 내부에 포함되어 있어야 한다!
		
		// 1. 문장들을 묶어놓은것
		// 	-> 메서드 생성
		//		->	메서드이름{	}
		//	-> 메서드호출(사용)
		//		-> 메서드명(	)
		
		// 2. 값(입력)을 받아서 처리하고, 결과를 반환(출력)
		//	-> 반환타입 메서드이름 (매개변수선언) {	}
		
		// 메서드의 장점?
		// 코드의 중복을 줄일 수 있다
		// 코드의 관리가 쉽다
		// 코드를 재사용할 수 있다
		// 코드가 간결해서 이해하기 쉽다
		
		// 메서드 작성
		// 반복적으로 수행되는 여러 문장을 메서드로 작성
		// 하나의 메서드는 한 가지 기능만 수행하도록 작성
		//	-> 유지보수 관련해서 용이하다.
		
		
		// 메서드의 선언부와 구현부
		//	-> 반환타입 메서드이름 (매개변수선언) 
		//	{
		//				구현부			
		//								}
		
		// 반환하고 싶은게 없는경우 반환타입에 void
		// 매개변수도 지역변수
		// 	-> 메서드가 종료되면 모두 사라짐
		//		-> 변수명이 겹쳐도 무관하다!
		

	}

}


